src/Embedded System/OMAP Overview.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: OMAP and DaVinci Resources
#+OPTIONS: num:nil

* www.ti.com/dummiesbook


* OMAP Power Management
http://elinux.org/OMAP_Power_Management

* http://wiki.davincidsp.com/

* http://www.tiexpressdsp.com/

* community.ti.com/forums

* Linux patches for most TI OMAP processors
http://www.muru.com/linux/omap/

* OMAP Linux mail list
http://linux.omap.com/pipermail/linux-omap-open-source/

* http://git.kernel.org/

* Real-Time Software Components (RTSC)
http://www.eclipse.org/rtsc/

* TMS320 DSP Algorithm Standard
http://www.ti.com/lit/ug/spru352g/spru352g.pdf

* xDAIS-DM (Digital Media) User Guide
http://www.ti.com/lit/ug/spruec8b/spruec8b.pdf

* Codec Engine Application Developer
http://www.ti.com/lit/ug/sprue67d/sprue67d.pdf

* wiki
** wiki.gumstix
http://wiki.gumstix.org/index.php?title=Main_Page

