public_html/Embedded-System/OMAP Overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OMAP and DaVinci Resources</title>
<!-- 2014-10-29 Wed 22:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">OMAP and DaVinci Resources</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">www.ti.com/dummiesbook</a></li>
<li><a href="#sec-2">OMAP Power Management</a></li>
<li><a href="#sec-3"></a></li>
<li><a href="#sec-4"></a></li>
<li><a href="#sec-5">community.ti.com/forums</a></li>
<li><a href="#sec-6">Linux patches for most TI OMAP processors</a></li>
<li><a href="#sec-7">OMAP Linux mail list</a></li>
<li><a href="#sec-8"></a></li>
<li><a href="#sec-9">Real-Time Software Components (RTSC)</a></li>
<li><a href="#sec-10">TMS320 DSP Algorithm Standard</a></li>
<li><a href="#sec-11">xDAIS-DM (Digital Media) User Guide</a></li>
<li><a href="#sec-12">Codec Engine Application Developer</a></li>
<li><a href="#sec-13">wiki</a>
<ul>
<li><a href="#sec-13-1">wiki.gumstix</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">www.ti.com/dummiesbook</h2>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">OMAP Power Management</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://elinux.org/OMAP_Power_Management">http://elinux.org/OMAP_Power_Management</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><a href="http://wiki.davincidsp.com/">http://wiki.davincidsp.com/</a></h2>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><a href="http://www.tiexpressdsp.com/">http://www.tiexpressdsp.com/</a></h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">community.ti.com/forums</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Linux patches for most TI OMAP processors</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="http://www.muru.com/linux/omap/">http://www.muru.com/linux/omap/</a>
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">OMAP Linux mail list</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="http://linux.omap.com/pipermail/linux-omap-open-source/">http://linux.omap.com/pipermail/linux-omap-open-source/</a>
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><a href="http://git.kernel.org/">http://git.kernel.org/</a></h2>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Real-Time Software Components (RTSC)</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="http://www.eclipse.org/rtsc/">http://www.eclipse.org/rtsc/</a>
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">TMS320 DSP Algorithm Standard</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="http://www.ti.com/lit/ug/spru352g/spru352g.pdf">http://www.ti.com/lit/ug/spru352g/spru352g.pdf</a>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">xDAIS-DM (Digital Media) User Guide</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="http://www.ti.com/lit/ug/spruec8b/spruec8b.pdf">http://www.ti.com/lit/ug/spruec8b/spruec8b.pdf</a>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Codec Engine Application Developer</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="http://www.ti.com/lit/ug/sprue67d/sprue67d.pdf">http://www.ti.com/lit/ug/sprue67d/sprue67d.pdf</a>
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">wiki</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1">wiki.gumstix</h3>
<div class="outline-text-3" id="text-13-1">
<p>
<a href="http://wiki.gumstix.org/index.php?title=Main_Page">http://wiki.gumstix.org/index.php?title=Main_Page</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-10-29 Wed 22:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
